<?php

namespace lesson02;

/**  1. Какие типы паттернов проектирования существуют? */
/*
Паттерны проектирования
1. Порождающие
    Создание новых объектов.

    1.1 Factory method - Фабричный метод
    1.2 Abstract Factory - Абстрактная фабрика
    1.3 Builder - Строитель
    1.4 Prototype - Прототип
    1.5 Singleton - Одиночка

2. Структурные
    Построение удобных в поддержке иерархий классов.

    2.1 Adapter - Адаптер
    2.2 Bridge - Мост
    2.3 Composite - Компоновщик
    2.4 Decorator - Декоратор
    2.5 Facade - Фасад
    2.6 Flyweight - Легковес
    2.7 Proxy - Заместитель

3. Поведенчиские
    Эффективное и безопасное взаимодействие объектов приложения.

    3.1 Chain of Responsibility - Цепочка обязанностей
    3.2 Command - Команда
    3.3 Iterator - Итератор
    3.4 Mediator - Посредник
    3.5 Memento - Снимок
    3.6 Observer - Наблюдатель
    3.7 State - Состояние
    3.8 Strategy - Cтратегия
    3.9 Template method - Шаблонный метод
    3.10 Visitor - Посетитель
*/
